function validateID(id) {
    //正则表达式 /\d{17}[0-9Xx]/ 表示含义为前17位为数字，最后1位为数字或X或x的一个有18个字符的字符串
    //var id_reg = new RegExp("\\d{17}[0-9Xx]")
    //进阶版的身份证号正则表达式（对日期进行了精确限制）
    // /[0-9]{6}(([19|20])(0[48]|[13579][26]|[2468][048])|(0[48]|[13579][26]|[2468][048])00)0229|(19[0-9]{2}|20[01][0-9])(((0[13578]|1[02])(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)(0[1-9]|[12][0-9]|30))|(02(0[1-9]|1[0-9]|2[0-8])))[0-9]{3}[0-9Xx]/
    var id_reg = new RegExp("[0-9]{6}(([19|20])(0[48]|[13579][26]|[2468][048])|(0[48]|[13579][26]|[2468][048])00)0229|(19[0-9]{2}|20[01][0-9])(((0[13578]|1[02])(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)(0[1-9]|[12][0-9]|30))|(02(0[1-9]|1[0-9]|2[0-8])))[0-9]{3}[0-9Xx]")
    if (!id_reg.test(input_id.value)) {
        var errmsg = new ErrMsg("100", "Wrong ID Number Format.");
        return errmsg;
    }
    var num = new Array();
    var sum = 0;
    for (var i = 0; i < 17; i++) {
        //将前17个数字单独地取出来
        num[i] = id.slice(i, i + 1);
        //将每一个数字乘上对应的系数(Math.pow(2, 18-(i+1)) % 11)并进行求和，其中i从0开始
        sum += num[i] * (Math.pow(2, 18 - (i + 1)) % 11);
        console.log(num[i] + " * " + (Math.pow(2, 18 - (i + 1)) % 11) + " = " + (num[i] * (Math.pow(2, 18 - (i + 1)) % 11)) + "------- sum = " + sum);

    }
    console.log(id.slice(17, 18) + "----" + "remainder is " + sum % 11)
    //将求得的和进行取余11操作，得到的数为0-10之间的一个数字，其中10用X或x表示
    //将得到的余数与验证码进行对照
    /*验证码与计算得的余数的对应关系
      余数为：0 1 2 3 4 5 6 7 8 9 X(10)
      验证码：1 0 X 9 8 7 6 5 4 3 2
      即：设余数为m，则对应验证码应该为((10-m)+2)%11
      其中，10代表没有偏移的上下两个数字相加之和（都相同，为同一个数字）；2表示向右偏移两位；11表示一行数字的个数；m为第一行某一数字的值
      没有偏移的上下两行数字：
      0 1 2 3 4 5 6 7 8 9 X
      X 9 8 7 6 5 4 3 2 1 0
      0+10,1+9,...,10+0 结果都等于10
    */
    //若对应成功，则为有效身份证号；反之，则无效
    if (((10 - (sum % 11)) + 2) % 11 == id.slice(17, 18) || (sum % 11 == 10 && (id.slice(17, 18) == "X" || id.slice(17, 18) == "x"))) {
        var errmsg = new ErrMsg("101", "Valid ID Number.");
    } else {
        var errmsg = new ErrMsg("102", "Invalid ID Number.");
    };
    return errmsg;
}

function ErrMsg(code, message) {
    this.code = code;
    this.message = message;
};